### Pandas DataFrame Manipulation

#### DataFrame manipulation in Pandas involves editing and modifying existing DataFrames. Some common DataFrame manipulation operations are:

1. Adding rows/columns
2. Removing rows/columns
3. Renaming rows/columns


### Add a New Column to a Pandas DataFrame
#### We can add a new column to an existing Pandas DataFrame by simply declaring a new list as a column.

In [10]:
import pandas as pd

# define a dictionary containing student data
data = {'Name': ['John', 'Emma', 'Michael', 'Sophia'],
        'Height': [5.5, 6.0, 5.8, 5.3],
        'Qualification': ['BSc', 'BBA', 'MBA', 'BSc']}

# convert the dictionary into a DataFrame
df = pd.DataFrame(data)


# # declare a new list (first step)
address = ['New York', 'London', 'Sydney', '']
# # # #
# # # # # assign the list as a column
#
df['Address'] = address
# # #
df

      Name  Height Qualification   Address
0     John     5.5           BSc  New York
1     Emma     6.0           BBA    London
2  Michael     5.8           MBA    Sydney
3   Sophia     5.3           BSc

### Add a New Row to a Pandas DataFrame
#### Adding rows to a DataFrame is not quite as straightforward as adding columns in Pandas. We use the `.loc` property to add a new row to a Pandas DataFrame.

In [12]:
import pandas as pd

# define a dictionary containing student data
data = {'Name': ['John', 'Emma', 'Michael', 'Sophia'],
        'Height': [5.5, 6.0, 5.8, 5.3],
        'Qualification': ['BSc', 'BBA', 'MBA', 'BSc']}

# convert the dictionary into a DataFrame
df = pd.DataFrame(data)

#
df.loc[2] = ['Sahil', 5.0, 'BDS']

#
df

     Name  Height Qualification
0    John     5.5           BSc
1    Emma     6.0           BBA
2   Sahil     5.0           BDS
3  Sophia     5.3           BSc

### Remove Rows/Columns from a Pandas DataFrame
#### We can use `drop()` to delete rows and columns from a DataFrame.

#### Remove Rows

In [15]:
import pandas as pd

# create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Felipe', 'Rita'],
        'Age': [25, 30, 35, 40, 22, 29],
        'City': ['New York', 'London', 'Paris', 'Tokyo', 'Bogota', 'Banglore']}

df = pd.DataFrame(data)


# # delete row with index 4
# df.drop(4, axis=0, inplace=True)
#
# # drop specific list
dropping_list = [1,3,5]
# #
df.drop(dropping_list, axis=0, inplace=True)
#

df

      Name  Age      City
0    Alice   25  New York
2  Charlie   35     Paris
4   Felipe   22    Bogota

#### Remove Columns

In [17]:
import pandas as pd

# create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Felipe', 'Rita'],
        'Age': [25, 30, 35, 40, 22, 29],
        'City': ['New York', 'London', 'Paris', 'Tokyo', 'Bogota', 'Banglore']}

df = pd.DataFrame(data)



# Drop a single column

# df.drop('Name', axis=1, inplace=True)
#


# # Drop multiple columns


df.drop(columns=['Name', 'Age'], inplace=True)
# df.drop(['column1', 'column2', 'column3'], axis=1, inplace=True)

df

       City
0  New York
1    London
2     Paris
3     Tokyo
4    Bogota
5  Banglore

### Rename Labels in a DataFrame
#### We can rename columns in a Pandas DataFrame using the rename() function.

In [18]:
import pandas as pd

# create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'London', 'Paris', 'Tokyo']}

# predicate pushdown and projection pushdown

df = pd.DataFrame(data)

rename_dict = {'Name': 'First_Name',
               'Age': 'Age_In_Years',
               'City': 'City_Name'}

# display the original DataFrame

# rename columns 'Age' and 'Name'
df.rename(rename_dict, axis=1, inplace=True)


df

  First_Name  Age_In_Years City_Name
0      Alice            25  New York
1        Bob            30    London
2    Charlie            35     Paris
3      David            40     Tokyo

### Pandas Select

- Pandas select refers to the process of extracting specific portions of data from a DataFrame.
- Data selection involves choosing specific rows and columns based on labels, positions, or conditions.
- Pandas provides various methods, such as basic indexing, slicing, boolean indexing, and querying, to efficiently extract, filter, and transform data, enabling users to focus on relevant information for analysis and decision-making.

### Select Data Using Indexing and Slicing
#### In Pandas, we can use square brackets and their labels or positions to select the data we want.

#### 1. Selecting a Single Column

In [20]:
import pandas as pd

# create a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 22, 27, 29],
    'Salary': [50000, 60000, 45000, 55000, 52000]
}

df = pd.DataFrame(data)


name_df = df['Name']

name_df

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object

#### 2. Selecting Multiple Columns

In [22]:
# this is my data frame selecting cols
select_list = ['Age', 'Salary']

# select specific columns and assign to new dataframe
age_salary_df = df[select_list] # --> df[['Age', 'Salary']]

age_salary_df

   Age  Salary
0   25   50000
1   30   60000
2   22   45000
3   27   55000
4   29   52000

#### 3. Using the `.loc[]` Accessor

In [24]:
selected_name = df.loc[:, 'Name'] # rows, columns

# select multiple columns
selected_subset = df.loc[:, ['Name', 'Age']]

selected_subset

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    David   27
4      Eve   29

#### 4. Advanced Selection with .filter()

In [26]:
# Select columns containing a substring (e.g., "A")
filtered_df = df.filter(like='A')

# Select columns using a regular expression (e.g., names starting with "N")
regex_filtered_df = df.filter(regex='^N')

regex_filtered_df

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eve

### Select Rows

#### To select rows in a pandas DataFrame based on a condition, you can use
- Boolean indexing
- .loc[] accessor,
- the .isin() method
- the .query() method

In [29]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(data)


# Age is greater than 30
df[df['Age'] > 30]

# Select rows where Age is greater than 30
# filtered_df = df[df['Age'] > 30]
#
# print(filtered_df)

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston

#### 2. Using .loc[] (Label-Based Indexing)

In [30]:
# Select rows where Age > 30 and only display 'Name' and 'City' columns
filtered_subset = df.loc[df['Age'] > 30, ['Name', 'City']]

filtered_subset

      Name     City
2  Charlie  Chicago
3    David  Houston

In [31]:
# Select rows where Age is > 30 AND City is 'Houston'
filtered_df_and = df[(df['Age'] > 30) & (df['City'] == 'Houston')]

filtered_df_and

    Name  Age     City
3  David   40  Houston

#### 3. Using .isin() (Membership)
The .isin() method is useful for selecting rows where a column's value is in a list of specific values

In [33]:
# Select rows where City is either 'New York' or 'Chicago'
cities_to_include = ['New York', 'Chicago']

df[df['City'].isin(cities_to_include)]

# filtered_df_isin = df[df['City'].isin(cities_to_include)]

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

#### 4.Using .query() (SQL-like Syntax)

In [35]:
# Select rows where Age is greater than 30 using query()
filtered_df_query = df.query('Age > 30') # select * from dataframe where Age > 30

# get only age column using query with filtering on Age > 30

# Select rows with multiple conditions using query()
options = ['Chicago', 'Houston'] # variable
filtered_df_query_multiple = df.query('Age > 30 and City in @options')
filtered_df_query_multiple

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston

### Pandas Handling Duplicate Values

- In large datasets, we often encounter duplicate entries in tables. These duplicate entries can throw off our analysis and skew the results.
- Pandas provides several methods to find and remove duplicate entries in DataFrames.


### Find Duplicate Entries

- We can find duplicate entries in a DataFrame using the duplicated() method. It returns True if a row is duplicated and returns False otherwise.

In [47]:
import pandas as pd

# create dataframe
data = {
    'Name': ['John', 'Anna', 'John', 'Anna', 'John'],
    'Age': [28, 24, 28, 24, 28],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)



df

# # check for duplicate entries
# df.duplicated()
#
# # check for duplicate entries in columns Name and Age
# df.duplicated(subset=['Name', 'Age'])

   Name  Age         City
0  John   28     New York
1  Anna   24  Los Angeles
2  John   28     New York
3  Anna   24  Los Angeles
4  John   28      Chicago

### Remove Duplicate Entries
- We can remove duplicate entries in Pandas using the drop_duplicates() method.

In [42]:
import pandas as pd

# create dataframe
data = {
    'Name': ['John', 'Anna', 'John', 'Anna', 'John'],
    'Age': [28, 24, 28, 24, 19],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# df

# remove duplicates
df.drop_duplicates(inplace=True, keep='last') #keep=last
# # #
df

   Name  Age         City
2  John   28     New York
3  Anna   24  Los Angeles
4  John   19      Chicago

### Practice Test
1. Add a new column called "`DiscountedAmount`" that is OrderAmount minus 10% discount.
2. Remove the "`Name`" column from the DataFrame.
3. Drop duplicate entries based on the "`CustomerID`" column (keep the first occurrence only).

In [ ]:
import pandas as pd

data = {
    'CustomerID': [101, 102, 103, 101, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'David'],
    'OrderAmount': [250, 450, 300, 250, 500]
}

df = pd.DataFrame(data)

### Problem 1: Creating a DataFrame

Task: Create a DataFrame with the following data:


`data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [24, 30, 35, 40],
        'City': ['New York', 'Toronto', 'London', 'Sydney']}`

Goal: Display the created DataFrame.
### Problem 2: Basic DataFrame Operations

1. Display only the Name and City columns.
2. Select and print the rows where Age is greater than 30.

### Problem 3: Adding and Deleting Columns

1. Add a new column named Salary with values [70000, 80000, 120000, 95000].
2. Delete the City column.
3. Goal: Display the updated DataFrame.